Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་སུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 78) There is the meditative stability named accumulation of all attributes. (

source: །སེམས་མེད་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 79) There is the meditative stability named abiding without mentation. (

source: །དགེ་བའི་མེ་ཏོག་རྒྱས་ཤིང་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 80) There is the meditative stability named blossoming and vibrance of the flowers of virtue. (

source: །བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 81) There is the meditative stability named endowed with the factors conducive to enlightenment. (

source: །སྤོབས་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 82) There is the meditative stability named boundless eloquence. (

source: །མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 83) There is the meditative stability named equal to the unequaled. (

source: །ཆོས་ཐམས་ཅད་ལས་འདའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 84) There is the meditative stability named transcending all phenomena. (

source: །ཡོངས་སུ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 85) There is the meditative stability named utterly devoid of delimitation. (

source: །ནེམ་ནུར་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 86) There is the meditative stability named dispelling of doubt. (

source: །གནས་སུ་བྱ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 87) There is the meditative stability named without settled focus. (

source: །གཅིག་ཏུ་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 88) There is the meditative stability named single array. (

source: །རྣམ་པ་མངོན་པར་བསྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 89) There is the meditative stability named manifest attainment of aspects. (

source: །རྣམ་པ་གཅིག་ཏུ་འགྱུར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 90) There is the meditative stability named unity. (

source: །རྣམ་པར་འདོར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 91) There is the meditative stability named nonexclusion. (

source: །སྲིད་པའི་གཞི་ཐམས་ཅད་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 92) There is the meditative stability named comprehension of all bases of rebirth [through realization]. (

source: །བརྡ་དང་སྒྲ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 93) There is the meditative stability named entrance to symbols and sounds. (

source: །སྒྲ་དབྱངས་ཀྱི་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 94) There is the meditative stability named devoid of vocalic syllables. (

source: །སྒྲོན་མ་འབར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 95) There is the meditative stability named burning lamp. (

source: །མཚན་ཉིད་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 96) There is the meditative stability named purification of defining characteristics. (

source: །མངོན་པར་དམིགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 97) There is the meditative stability named manifestly nonperceived. (

source: །རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 98) There is the meditative stability named endowed with all finest aspects. (

source: །བདེ་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 99) There is the meditative stability named absence of joy with respect to all happiness and suffering. (

source: །ཟད་མི་ཤེས་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 100) There is the meditative stability named inexhaustible cornucopia. (

source: །གཟུངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 101) There is the meditative stability named dhāraṇī intelligence. (

source: །ཡང་དག་པ་དང་ལོག་པ་ཐམས་ཅད་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 102) There is the meditative stability named complete elimination of right and wrong. (

source: །འགལ་བ་དང་འགོག་པ་ཐམས་ཅད་ཡང་དག་པར་ཞི་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 103) There is the meditative stability named calming of all deviations and obstacles. (

source: །འཐུན་པ་དང་འགལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 104) There is the meditative stability named absence of disharmony. (

source: །སྙིང་པོ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 106) There is the meditative stability named endowed with the essence. (

source: །ཟླ་བ་དྲི་མ་མེད་པར་རྒྱས་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 107) There is the meditative stability named taintless light of the full moon. (

source: །གློག་གི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 108) There is the meditative stability named lightning light. {

source: །རྒྱན་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: Dt.144} (109) There is the meditative stability named great ornament. (

source: །རྣམ་པ་ཐམས་ཅད་དུ་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 110) There is the meditative stability named illuminator of all worlds. (

source: །ཏིང་ངེ་འཛིན་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 111) There is the meditative stability named sameness of meditative stability. (

source: །རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་ཚུལ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ། །ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 112) There is the meditative stability named taintless principle devoid of impurities. (

source: །ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 113) There is the meditative stability named convergence in nonaffliction. (

source: །གནས་དམིགས་སུ་མེད་པ་ལ་བརྩོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 114) There is the meditative stability named engaging in remaining without an objective support. (

source: །དེ་བཞིན་ཉིད་ལ་གནས་ཤིང་སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 115) There is the meditative stability named abiding in the real nature without mentation. (

source: །ལུས་ཀྱི་སྐྱོན་ཡང་དག་པར་སེལ་བས་རབ་ཏུ་འདུལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 116) There is the meditative stability named tamed by dispelling the misery of corporeality. (

source: །ངག་གི་སྐྱོན་རྣམ་པར་འཇིག་པས་ནམ་མཁའ་ལྟར་གྱུར་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དོ།
en: 117) There is the meditative stability named obliterating defects of speech, transforming them as if into space.

source: །ཤ་ར་དྭ་ཏིའི་བུ་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས་རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ།
en: And, Śāradvatīputra, (118) there is the meditative stability named unattached, liberated, and uncovered like space.

source: ཏིང་ངེ་འཛིན་དེས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་ཏེ། ཏིང་ངེ་འཛིན་དེ་དག་གིས་རྣམ་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: By engaging with these meditative stabilities, bodhisattva great beings will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment.

source: དེ་ལྟར་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་གང་ལ་བསླབས་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ལྟ་བུ་ཚད་མེད་གྲངས་མེད་པ་གཞན་དག་ཀྱང་ཡོད་དེ།
en: And there are also countless and inestimable other gateways of meditative stability and dhāraṇī, like these, through which bodhisattva great beings will swiftly attain consummate buddhahood in unsurpassed, complete enlightenment.”

source: དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཡང་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཏིང་ངེ་འཛིན་དེ་དག་གིས་རྣམ་པར་སྤྱོད་པ་དེ་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏོ།
en: Then, through the power of the Buddha, the venerable Subhūti said, “Venerable Śāradvatīputra, the tathāgatas, arhats, genuine perfect buddhas of the past have indeed prophesied that any bodhisattva great being who dwells in those meditative stabilities will attain unsurpassed, complete enlightenment.

source: །ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་གིས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཏེ།
en: The tathāgatas, arhats, completely awakened buddhas who are presently alive, residing in the world systems of the ten directions, numerous as the grains of sand of the river Gaṅgā, also prophesied that those bodhisattva great beings will attain unsurpassed, complete enlightenment. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ནི་ཏིང་ངེ་འཛིན་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Bodhisattva great beings do not even observe those meditative stabilities.

source: །བདག་ནི་སྙོམས་པར་ཞུགས་སོ་ཞེས་བྱ་བར་ཏིང་ངེ་འཛིན་དེས་རློམ་སེམས་སུ་འགྱུར་བ་ཡང་མེད་དོ། །བདག་ནི་སྙོམས་པར་འཇུག་གོ །
en: They will not give rise to conceits on account of those meditative stabilities, thinking, ‘I have been absorbed in meditation.

source: བདག་གིས་མཉམ་པར་གཞག་པར་བྱའོ།
en: I am absorbed in meditation.

source: །བདག་ནི་མཉམ་པར་གཞག་པར་གྱུར་ཏོ་ཞེས་རློམ་སེམས་སུ་འགྱུར་བ་མེད་དེ།
en: I will be absorbed in meditation.’

source: དེ་ལ་རྣམ་པར་རྟོག་པ་དེ་དག་ཐམས་ཅད་མེད་ཅིང་མི་རྒྱུའོ། །སྨྲས་པ།
en: All such conceptual imaginations are absent and will not arise.” {

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཏིང་ངེ་འཛིན་འདི་དག་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ལུང་བསྟན་པ་ཡོད་དམ།
en: Dt.145} “Venerable Subhūti, are bodhisattva great beings who dwell in these meditative stabilities prophesied by the tathāgatas, arhats, completely awakened buddhas?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་མེད་དོ།
en: Venerable Śāradvatīputra, that is not the case!” replied Subhūti. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་གཞན་ལ། ཏིང་ངེ་འཛིན་ཀྱང་གཞན་བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་ཞེས་བྱ་བ་མེད་ཀྱི།
en: If you ask why, Venerable Śāradvatīputra, the perfection of wisdom, the meditative stabilities, and bodhisattva great beings are not distinct from one another.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་ཏིང་ངེ་འཛིན་ཏོ།
en: Rather, the perfection of wisdom itself constitutes the meditative stabilities.

source: །ཏིང་ངེ་འཛིན་ཉིད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའོ།
en: The meditative stabilities themselves constitute the bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་ཏིང་ངེ་འཛིན་ཏོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གལ་ཏེ་དེ་ལྟར་ཏིང་ངེ་འཛིན་ཀྱང་གཞན་ལ།
en: The bodhisattvas themselves constitute the meditative stabilities.” “

source: བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་ཞེས་བྱ་བ་མེད། བྱང་ཆུབ་སེམས་དཔའ་ཡང་གཞན་ལ་ཏིང་ངེ་འཛིན་ཀྱང་གཞན་ཞེས་བྱ་བ་མེད་དེ། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་ཕྱིར་ཏིང་ངེ་འཛིན་ཉིད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ། བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱང་ཏིང་ངེ་འཛིན་ཡིན་ན། དེ་ལ་ཏིང་ངེ་འཛིན་བསྟན་པར་ནུས་སམ།
en: Venerable Subhūti, if the meditative stabilities and the bodhisattvas are not distinct from one another, and if the meditative stabilities are themselves the bodhisattvas, and the bodhisattvas are themselves the meditative stabilities owing to the sameness of all phenomena, is it then possible to teach those meditative stabilities?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra, it is not!”

source: །སྨྲས་པ།
en: replied Subhūti. “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རིགས་ཀྱི་བུ་དེ་ཏིང་ངེ་འཛིན་དེ་ལ་འདུ་ཤེས་སུ་བྱེད་དམ།
en: Venerable Subhūti, do those noble children perceive these meditative stabilities?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདུ་ཤེས་སུ་བྱེད་པ་མེད་དོ།
en: Venerable Śāradvatīputra, they do not perceive them!”

source: ཇི་ལྟར་དེ་ལ་འདུ་ཤེས་སུ་བྱེད་པར་མི་འགྱུར།
en: How do they not perceive them?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། རྟོག་པ་མེད་པའི་ཕྱིར་རོ། །སྨྲས་པ།
en: Because they are without conceptual thought,” replied Subhūti. “

source: དེ་ལ་ཇི་ལྟར་རྟོག་པ་མེད་པ་ཡིན།
en: How are they without conceptual thought?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཆོས་ཐམས་ཅད་མེད་པའི་ཕྱིར་རྟོག་པ་མེད་དེ།
en: They are without conceptual thought because all phenomena are nonexistent,” replied Subhūti. “

source: དེ་ལྟར་ན་རིགས་ཀྱི་བུ་དེ་ཏིང་ངེ་འཛིན་དེ་ལ་རྟོག་པ་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་དེས་ན།
en: So it is that those noble children have no conceptual thoughts regarding those meditative stabilities.

source: རིགས་ཀྱི་བུ་དེ་ཏིང་ངེ་འཛིན་དེ་ལ་རྣམ་པར་ཤེས་པར་བྱེད་པ་མེད་དོ།
en: That, Venerable Śāradvatīputra, is the formulation explaining how those noble children are not conscious of those meditative stabilities.

source: །འདུ་ཤེས་སུ་བྱེད་པ་མེད་དོ།
en: They do not perceive them.” “

source: །སྨྲས་པ། ཅིའི་ཕྱིར་རྣམ་པར་ཤེས་པར་བྱེད་པ་མེད་ཅིང་། འདུ་ཤེས་སུ་འགྱུར་བ་མེད།
en: Why are they not conscious, and why do they not perceive them?” “

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཏིང་ངེ་འཛིན་དེ་ཡང་མེད་ལ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཡང་མེད་པའི་ཕྱིར་རྣམ་པར་ཤེས་པར་བྱེད་པ་མེད་དོ། །འདུ་ཤེས་སུ་འགྱུར་བ་མེད་དོ།
en: They are not conscious and do not perceive them because the meditative stabilities are nonexistent, and bodhisattva great beings, also, are nonexistent,” replied Subhūti.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ་རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed Lord congratulated the venerable Subhūti with these words: “Well said, Subhūti! Well said!

source: །ཚིག་འདི་ནི་ལེགས་པར་བཤད་དོ། །ཇི་ལྟར་ངས་ཉོན་མོངས་པ་མེད་པ་ལ་རྣམ་པར་སྤྱོད་པའི་ཉན་ཐོས་ཀྱི་ནང་ན་མཆོག་ཏུ་བཤད་པ་དེས་བཤད་པ་ནི་འདི་ཡིན་ནོ།
en: You, whom I have declared to be foremost among śrāvakas practicing free from afflicted mental states, have spoken these words eloquently!

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: So it is that bodhisattva great beings should indeed train in the perfection of wisdom, {Dt.146} and they should train in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་བསླབ་པར་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: They should train in the factors conducive to enlightenment and [in the fruitional attributes], up to and including the eighteen distinct attributes of the buddhas.”

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པོ།
en: Then the venerable Śāradvatīputra asked the Blessed One, “Blessed Lord, do bodhisattva great beings train in the perfection of wisdom without apprehending anything, and do they train in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity without apprehending anything?

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Do they train in the factors conducive to enlightenment and [in the fruitional attributes], up to and including the eighteen distinct attributes of the buddhas, without apprehending anything?” “

source: ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སློབ་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ཡིན། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ཡིན།
en: Śāradvatīputra,” replied the Blessed Lord, “when bodhisattva great beings train accordingly, they do train in the perfection of wisdom without apprehending anything, and they do train in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity without apprehending anything.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ལ་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ཡིན་ནོ།
en: They do train in the factors conducive to enlightenment and [in the fruitional attributes], up to and including the eighteen distinct attributes of the buddhas, without apprehending anything.”

source: །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་མི་དམིགས་པ་ལགས།
en: Then the venerable Śāradvatīputra asked, “Blessed Lord, what is it that they do not apprehend?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་བདག་མི་དམིགས་སོ། །སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་།
en: The Blessed Lord replied, “Owing to the utter purity [of all phenomena], they do not apprehend a self.

source: ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་། ཤེས་པ་པོ་མི་དམིགས་སོ།
en: They do not apprehend sentient beings, life forms, living beings, life, living creatures, individuals, human beings, people, actors, experiencers, knowers, [or viewers].

source: །ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར། ཕུང་པོ་དང་། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend the psycho-physical aggregates, the sense fields, the sensory elements, or the links of dependent origination.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་སྡུག་བསྔལ་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend [the truth of] suffering.

source: །ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend [the truths of] the cause of suffering, the cessation of suffering, or the path that leads to it.

source: །ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་འདོད་པའི་ཁམས་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend the realm of desire.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་གཟུགས་ཀྱི་ཁམས་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend the realm of form.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་གཟུགས་མེད་པའི་ཁམས་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend the realm of formlessness.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་མི་དམིགས་སོ། །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བས
en: Owing to the utter purity [of all phenomena], they do not apprehend the perfections.

source: མ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རྒྱུན་དུ་ཞུགས་པ་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend those who enter the stream to nirvāṇa.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend those who are destined for only one more rebirth, those who will not be reborn, those who have attained arhatship, or pratyekabuddhas.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend bodhisattvas.

source: །ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་བྱང་ཆུབ་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend enlightenment.

source: །ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཕྱིར་སངས་རྒྱས་མི་དམིགས་སོ།
en: Owing to the utter purity [of all phenomena], they do not apprehend buddhas.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་གང་ལགས།
en: Blessed Lord, what is that purity?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། མི་འགག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་།
en: Purity indicates that all phenomena are nonarising, unceasing, neither afflicted nor purified, nonemerging, nonapprehensible, and unconditioned,” replied the Blessed One. “

source: འབྱུང་བ་མེད་པ་དང་། དམིགས་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་འདི་ནི་རྣམ་པར་དག་པ་ཞེས་བྱ་སྟེ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་ཚུལ་གྱིས་སློབ་པ་ཡིན་ནོ།
en: Śāradvatīputra, so it is that bodhisattva great beings train with respect to all phenomena, without apprehending anything.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་གང་དང་གང་ལ་སློབ་པ་ལགས།
en: Blessed Lord, in what phenomena do bodhisattva great beings who train accordingly then train?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་གང་ལ་ཡང་སློབ་པ་མེད་དོ།
en: Śāradvatīputra,” replied the Blessed One, “bodhisattva great beings who train accordingly, do not train in anything at all. {

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་ཆོས་འདི་དག་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོས་ཇི་ལྟར་མངོན་པར་ཆགས་པར་བྱ་བ་དེ་ལྟ་བུའི་རྣམ་པར་ཡོད་པ་མ་ཡིན་ནོ། །གསོལ་པ།
en: Dt.147} If you ask why, Śāradvatīputra, it is because these phenomena are nonexistent in the ways that ordinary people are fixated on them.” “

source: བཅོམ་ལྡན་འདས་འོ་ན་ཆོས་འདི་དག་རྣམ་པ་གང་གིས་མཆིས་པ་ལགས།
en: Blessed Lord, how then do these phenomena exist?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཇི་ལྟར་མེད་པ་དེ་ལྟར་ཡོད་དེ། དེ་ལྟར་ཡོད་པ་མ་ཡིན་པས། དེའི་ཕྱིར་མེད་ཅེས་བྱའོ།
en: They exist to the extent that they do not exist, and accordingly, since they do not exist, they are said to be nonexistent,” replied the Blessed One. “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་མཆིས་པ་མ་ལགས་པ་དེ་ལ་མཆིས་པ་ཞེས་བགྱི།
en: Blessed Lord,” he asked, “why are these phenomena that do not exist said to exist?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་ཡོད་པ་མ་ཡིན་ནོ།
en: Śāradvatīputra,” replied the Blessed One, “it is owing to the emptiness of internal phenomena, and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that physical forms are nonexistent.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ན་ང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་གྱི་ཕྱིར་ཡོད་པ་མ་ཡིན་ནོ།
en: It is owing to the emptiness of internal phenomena, and to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, that feelings, perceptions, formative predispositions, and consciousness are nonexistent.
